const taskDataOne = [
    {
        id: 1,
        txt: `Створіть 3 змінних з наступими значеннями: 15.678, 123.965, 90.2345. Ці змінні зберігають ціни на товари`
    },
    {
        id: 2,
        txt: `Використовуючи вбудований об'єкт Math – виведіть максимальне число`
    },
    {
        id: 3,
        txt: `Використовуючи вбудований об'єкт Math – виведіть мінімальне число`
    },
    {
        id: 4,
        txt: `Складіть вартість всіх товарів, помістіть її в змінну та виведіть цю суму`
    },
    {
        id: 5,
        txt: `Відкиньте копійки у всіх товарів, потім – складіть цілу частину вартості кожного товару між собою. Округлення використовувати в МЕНШУ сторону.`
    },
    {
        id: 6,
        txt: `Виведіть суму товарів округлену до сотень. (Наприклад якщо вийшло 260, то виведіть 300)`
    },
    {
        id: 7,
        txt: `Виведіть булеве значення: чи є сума всіх товарів (округлена в меншу сторону) парним чи непарним числом?`
    },
    {
        id: 8,
        txt: `Виведіть суму решти, при оплаті всіх товарів (без округлення), якщо клієнт платить 500 грн.`
    },
    {
        id: 9,
        txt: `Виведіть середнє значення цін, округлене до другого знаку після коми`
    },
    {
        id: 10,
        txt: `Створіть змінну, в якої збережіть випадкову знижку (використовуйте функцію Math.random).`
    },
    {
        id: 11,
        txt: `Зробіть клієнту випадкову знижку та виведіть суму до оплати округлену до 2 знаків після коми.`
    },
    {
        id: 12,
        txt: 'Виведіть чистий прибуток, якщо клієнт заплатив зі знижкою та собівартість товарів рівно в два рази нижче їх ціни?'
    },
    {
        id: 13,
        txt: 'Створіть шаблонний рядок та виведіть всі обчислення вчинені в Base частині домашнього завдання у вигляді одного рядка наступного вигляду: Максимальна ціна: 9999.99 Мінімальна ціна: 1111.11 Вартість всіх товарів: 1345.66 ...і так далі'
    }
];

export default taskDataOne;