const taskDataFive = [
    {
        id: 1,
        txt: `Створіть функцію filterEvenNumbers(...numbers) – яка фільтрує парні числа, передані як аргументи функції.`
    },
    {
        id: 2,
        txt: `Створіть функцію getAverage(...numbers) – яка рахує середнє арифметичне всіх переданих в неї аргументів.`
    },
    {
        id: 3,
        txt: `Створіть функцію getDividedByFive(...numbers) – яка відфільтрує усі елементи в масиві та залишить тільки ті, які діляться на ціло на 5.`
    },
    {
        id: 4,
        txt: `Створіть функцію countPositiveNumbers(...numbers) – яка порахує кількість чисел більших 0.`
    },
    {
        id: 5,
        txt: `Створіть функцію divideByThree(word), яка розбиває кожне слово на умовні склади по 3 букви. Якщо букв менше трьох – не розбиває. Пробіли завжди видаляються. Рядок приводится до нижнього регістру.`
    },
    {
        id: 6,
        txt: `Створіть функцію getRandomArray(length, min, max) – яка повертає масив випадкових цілих чисел. У функції є параметри: length - довжина масиву, min – мінімальне значення цілого числа, max – максимальне значення цілого числа.`
    }
];

export default taskDataFive;
