const taskDataTwo = [
    {
        id: 1,
        txt: `Необхідно написати програму, яка виконує складання чисел від N до M (N та M – задаються користувачем), а також програма має вміти пропускати парні числа.Отримайте у користувача число(N) від якого ми будемо рахувати:`
    },
    {
        id: 2,
        txt: `Перевірте, чи є передане значення N ЦІЛИМ числом.`
    },
    {
        id: 3,
        txt: `Отримайте у користувача число(M) до якого ми будемо складати (включно).`
    },
    {
        id: 4,
        txt: `Перевірте, чи є передане значення M ЦІЛИМ числом.`
    },
    {
        id: 5,
        txt: `Отримайте у користувача булевий параметр(true/false), який підкаже нам чи потрібно пропускати парні числа. TRUE – потрібно, FALSE – не потрібно.`
    },
    {
        id: 6,
        txt: `Напишіть цикл, який буде складати числа від раніше отриманих N та M. В циклі додайте перевірку – чи потрібно пропускати при складанні парні числа. Виведіть результат`
    }
];

export default taskDataTwo;