// Необхідно написати програму, яка виконує складання чисел від N до M (N та M – задаються користувачем), а також програма має вміти пропускати парні числа.

// Отримайте у користувача число(N) від якого ми будемо
// Отримати число можна за допомогою prompt.
// Пам'ятайте, ЧИСЛО, не РЯДОК!
let N = +prompt('Введіть перше число, будь ласка. Воно повинно дорівнювати або бути більше 0.');

// Перевірте, чи є передане значення N ЦІЛИМ числом.
// (Підказка: якщо при конвертації в ціле число ми отримали NaN – це
//  число нам не підходить)
const firstCheck = Number.isInteger(N) ?`Перше число нам підходить.` : `Перше число нам не підходить.`;
console.log(firstCheck);
document.querySelector("#second").textContent = firstCheck;
console.log(`Перше число, введене користувачем, - ${N}`);
document.querySelector('#first').textContent = N;

// Отримайте у користувача число(M) до якого ми будемо складати
// (включно).
// Отримати число можна за допомогою prompt.
// Пам'ятайте, ЧИСЛО, не РЯДОК!
const M = +prompt('Введіть друге число, будь ласка (більше за перше!)');
console.log(`Друге число, введене користувачем, - ${M}`);
document.querySelector("#third").textContent = M;

// Перевірте, чи є передане значення M ЦІЛИМ числом.
// (Підказка: якщо при конвертації в ціле число ми отримали NaN – це число нам не підходит)
const secondCheck = Number.isInteger(M) ? `Друге число нам підходить.` : `Друге число нам не підходить.`;
console.log(secondCheck);
document.querySelector("#four").textContent = secondCheck;

// Отримайте у користувача булевий параметр(true/false), який
// підкаже нам чи потрібно пропускати парні числа. TRUE – потрібно,
// FALSE – не потрібно. Використовуйте функцію confirm
const evenCheck = confirm("Чи не потрібно враховувати парні? OK - не потрібно, Cancel - потрібно.");
const checkRew = evenCheck ? `Ви обрали не враховувати парні числа` : `Ви обрали враховувати парні числа`;
console.log(checkRew);
document.querySelector("#five").textContent = checkRew;

// Напишіть цикл, який буде складати числа від раніше отриманих
// N та M

// В циклі додайте перевірку – чи потрібно пропускати при
// складанні парні числа.
// (Використовуйте для цього if/else).
// Якщо парні числа потрібно пропускати не додавайте їх до суми.
let sum = 0;
if (evenCheck) {
    for (let i = N; i <= M; i++) {
        if (i % 2 != 0) {
            sum += i;
            console.log(sum, i)
        }
    }
} else {
    for (let i = N; i <= M; i++) {
            sum += i;
            console.log(sum, i);
    }
}

document.querySelector("#six").textContent = sum;

console.log(`Сума обраних чисел ${sum}`);
// Виведіть результат