const taskDataThree = [
    {
        id: 1,
        txt: `Створити функцію getMaxDigit(number) – яка отримує будь-яке число та виводить найбільшу цифру в цьому числі.`
    },
    {
        id: 2,
        txt: `Створити функцію, яка форматує ім'я, роблячи першу букву великою.`
    },
    {
        id: 3,
        txt: `Створити функцію, яка повертає випадкове ціле число в діапазоні від N до M.`
    },
    {
        id: 4,
        txt: `Створити функцію, яка вираховує суму, що залишається після оплати податку  від зарабітньої плати.`
    },
    {
        id: 5,
        txt: `Створіть функцію генерації випадкового паролю (тільки числа), довжина встановлюється користувачем або по замовчуванню = 8 символам.`
    },
    {
        id: 6,
        txt: `Створіть функцію, яка видаляє всі букви з речення.`
    }
];

export default taskDataThree;
