const taskDataNine = [
    {
        id: 1,
        txt: `Зродіть 25 квадратів розміру 50х50 пікселів кожен, зафарбовані у випадковий колір. Квадрати мають розташовуватись по 5 в ряд.
        <br>
        Щоб квадрати з'явились на сторінці, необхідно викликати функцію <span>generateBlocks();<span>.
        <br>
        Зробіть так, щоб квадрати змінювали колір раз на секунду.
        <br>
        Щоб квадрати з'явились на сторінці та почали змінюватись, необхідно викликати функцію <span>generateBlocksInterval();</span>.
        `
    }
];

export default taskDataNine;
